Repository: glpi-project/doc-install
Catalog: source/locale/*/LC_MESSAGES/install/index.po
Languages: de_de

source: Install GLPI
de_de: GLPI installieren

source: Proceed as follow:
de_de: Gehen Sie wie folgt vor:

source: Choose a version,
de_de: Version wählen,

source: Download the archive,
de_de: Archiv herunterladen,

source: Install :)
de_de: Installieren :)

source: Choose a version
de_de: Version wählen

source: It is hightly recommended you choose the latest stable release for a production usage.
de_de: Es wird dringend empfohlen, die neueste stabile Version für den produktiven Einsatz zu wählen.

source: GLPI follows a semantic versioning scheme, on 3 digits. The first one is the major release, the second the minor and the third the fix release.
de_de: GLPI folgt einem semantischen Versionierungsschema mit 3 Ziffern. Die erste ist die Hauptversion (Major), die zweite die Kleinere (Minor) und die dritte die Korrekturversion (Bugfix).

source: Major releases may come with important incompatibilities as well as new features; minor versions may bring new features as well, but stay perfectly compatible inside a major version.
de_de: Hauptversionen können mit wichtigen Inkompatibilitäten und neuen Funktionen verbunden sein; kleinere Versionen können auch neue Funktionen enthalten, bleiben aber innerhalb einer Hauptversion perfekt kompatibel.

source: Fixes releases will only fix reported issues without adding anything new.
de_de: Bugfixes-Releases beheben nur gemeldete Probleme, ohne etwas Neues hinzuzufügen.

source: On GitHub, there are always two archives named *Source code* which should not be used.
de_de: Auf GitHub gibt es immer zwei Archive namens *Source code*, die nicht verwendet werden sollten.

source: Go to the *download* section of `the GLPI website <http://glpi-project.org>`_ (or get archive directly from `Github release <https://github.com/glpi-project/glpi/releases>`_) and choose the ``glpi-{version}.tgz`` archive.
de_de: Gehen Sie zum *Download*-Bereich der GLPI-Website <http://glpi-project.org>``_ (oder holen Sie sich das Archiv direkt von `Github-Release <https://github.com/glpi-project/glpi/releases>``_) und wählen Sie das Archiv ``glpi-{version}.tgz``.

source: Packages may be available from your Linux distribution (Red Hat, CentOS, Fedora, Ubuntu, ...) that you should use with your standard packages manager as usual.
de_de: Fertige Pakete können in Ihrer Linux-Distribution (Red Hat, CentOS, Fedora, Ubuntu,...) verfügbar sein, die Sie wie gewohnt mit Ihrem Standard-Paketmanager verwenden sollten.

source: GLPI installation itself is composed of three steps:
de_de: Die GLPI-Installation selbst besteht aus drei Schritten:

source: Uncompress the archive in your website;
de_de: Entpacken Sie das Archiv auf Ihrer Website;

source: Give your webserver write access to the ``files`` and ``config`` directories;
de_de: Geben Sie Ihrem Webserver Schreibzugriff auf die Verzeichnisse ``files`` und ``config```;

source: :doc:`launch installation wizard <wizard>` (or use the :ref:`command line installation script <cdline_install>`).
de_de: :doc:`Installationsassistent starten <wizard>` (oder das :ref:`Kommandozeilen-Installationsskript verwenden <cdline_install>`).

source: Once these three steps have been completed the application is ready to be used.
de_de: Nach Abschluss dieser drei Schritte ist die Anwendung einsatzbereit.

source: Files and directories locations
de_de: Speicherorte von Dateien und Verzeichnissen

source: Like many other web applications, GLPI can be installed by just copying the whole directory to any web server. However, this may be less secure.
de_de: Wie viele andere Webanwendungen kann GLPI installiert werden, indem man einfach das gesamte Verzeichnis auf einen beliebigen Webserver kopiert. Dies kann jedoch weniger sicher sein.

source: Every file accessible directly from a web server must be considered unsafe!
de_de: Jede Datei, die direkt von einem Webserver aus zugänglich ist, muss als unsicher angesehen werden!

source: GLPI stores some data in the ``files`` directory, the database access configuration is stored in the ``config`` directory, etc. Even if GLPI provides some ways to prevent files from being accessed by the webserver directly, best practise is to store data outside of the web root. That way, sensitive files cannot be accessed directly from the web server.
de_de: GLPI speichert einige Daten im Verzeichnis ``files``, die Konfiguration des Datenbankzugriffs wird im Verzeichnis ``config`` gespeichert, etc. Auch wenn Dateien nicht direkt vom Webserver aufgerufen werden können, sollten Daten außerhalb des Web-Root-Verzeichnisses gespeichert werden. Auf diese Weise kann nicht direkt vom Webserver auf sensible Dateien zugegriffen werden.

source: There are a few configuration directives you may use to achieve that (directives that are used in provided downstream packages):
de_de: Es gibt einige Konfigurationsanweisungen, die Sie verwenden können, um dies zu erreichen (Anweisungen, die in bereitgestellten Downstream-Paketen verwendet werden):

source: ``GLPI_CONFIG_DIR``: set path to the configuration directory;
de_de: ``GLPI_CONFIG_DIR``: setzt den Pfad zum Konfigurationsverzeichnis;

source: ``GLPI_VAR_DIR`` : set path to the ``files`` directory;
de_de: ``GLPI_VAR_DIR`` : setzt den Pfad zum ``files`` Verzeichnis;

source: ``GLPI_LOG_DIR`` : set path to logs files.
de_de: ``GLPI_LOG_DIR`` : setzt den Pfad zu den Konfigurationsdateien.

source: There are many other configuration directives available, the ones we talked about are the main to take into account for a more secure installation.
de_de: Es gibt weitere Konfigurationsrichtlinien. Die oben genannten sind für eine sicherere Installation ausreichend.

source: Directories choice is entirely up to you; the following example will follow the `FHS <http://www.pathname.com/fhs/>`_ recommendations.
de_de: Die Wahl der Verzeichnisse liegt ganz bei Ihnen; das folgende Beispiel folgt den Empfehlungen von `FHS <http://www.pathname.com/fhs/>``_.

source: Our GLPI instance will be installed in ``/var/www/glpi``, a specific virtual host in the web server configuration will reflect this path.
de_de: Unsere GLPI-Instanz wird in ``/var/wwww/glpi`` installiert, ein bestimmter virtueller Host in der Webserver-Konfiguration spiegelt diesen Pfad wider.

source: GLPI configuration will be stored in ``/etc/glpi``, just copy the ``config`` directory to this place. GLPI requires read rights on this directory to work; and write rights during the installation process.
de_de: Die GLPI-Konfiguration wird in ``/etc/glpi`` gespeichert, kopieren Sie einfach das Verzeichnis ``config`` an diesen Ort. GLPI benötigt Leserechte auf diesem Verzeichnis, um zu funktionieren; und Schreibrechte während des Installationsprozesses.

source: GLPI data will be stored in ``/var/lib/glpi``, just copy the ``files`` directory to this place. GLPI requires read and write rights on this directory.
de_de: GLPI-Daten werden in ``/var/lib/glpi`` gespeichert, kopieren Sie einfach das Verzeichnis ``files`` an diesen Ort. GLPI benötigt Lese- und Schreibrechte auf dieses Verzeichnis.

source: GLPI logs files will be stored in ``/var/log/glpi``, there is nothing to copy here, just create the directory. GLPI requires read and write access on this directory.
de_de: GLPI-Protokolldateien werden in ``/var/log/glpi`` gespeichert, es gibt hier nichts zu kopieren, erstellen Sie einfach das Verzeichnis. GLPI benötigt Lese- und Schreibzugriff auf dieses Verzeichnis.

source: Following this instructions, we'll create a ``inc/downstream.php`` file into GLPI directory with the following contents:
de_de: Im GLPI-Verzeichnis erstellen wir mit nachfolgenden Anweisungen eine Datei ``inc/downstream.php`` mit folgendem Inhalt:

source: GLPI packages will certainly provide a ``inc/downstream.php`` file. This one must not be edited!
de_de: GLPI-Pakete werden natürlich eine ``inc/downstream.php`` Datei liefern. Diese darf nicht bearbeitet werden!

source: Then, create a file in ``/etc/glpi/local_define.php`` with the following contents:
de_de: Erstellen Sie eine Datei ``/etc/glpi/local_define.php`` mit folgendem Inhalt:

source: For GLPI prior to 9.2.2, the ``GLPI_VAR_DIR`` constant did not exist and it was required to set all paths separately:
de_de: Für GLPI vor 9.2.2 war die Konstante ``GLPI_VAR_DIR`` nicht vorhanden und es war erforderlich, alle Pfade separat einzustellen:

source: Post installation
de_de: Nach der Installation

source: Once GLPI has been installed, you're almost done.
de_de: Nachdem GLPI installiert ist, sind Sie fast fertig.

source: An extra step would be to secure (or remove) installation directory. As an example, you can consider adding the following to your Apache virtual host configuration (or in the ``glpi/install/.htaccess`` file):
de_de: Ein zusätzlicher Schritt wäre, das Installationsverzeichnis zu sichern (oder zu entfernen). Zum Beispiel können Sie erwägen, Folgendes zu Ihrer virtuellen Apache-Host-Konfiguration hinzuzufügen (oder in der Datei ``glpi/install/.htaccess``):

source: With this example, the `install` directory access will be limited to localhost only and will display an error message otherwise. Of course, you may have to adapt this to your needs; refer to your web server's documentation.
de_de: In diesem Beispiel ist der Zugriff auf das Verzeichnis `install` auf localhost beschränkt und zeigt ansonsten eine Fehlermeldung an. Natürlich müssen Sie dies möglicherweise an Ihre Bedürfnisse anpassen; lesen Sie dazu die Dokumentation Ihres Webservers.
