Repository: glpi-project/doc-install
Catalog: source/locale/*/LC_MESSAGES/install/wizard.po
Languages: de_de, fr_fr

source: Install wizard
de_de: Installationsassistent
fr_fr: Assistant d'installation

source: To begin installation process, point your browser to the GLPI main address: `https://{adresse_glpi}/ <https://{adresse_glpi}/>`_
de_de: Um mit der Installation zu beginnen, rufen Sie in Ihren Browser die GLPI-Hauptadresse auf: `https://{adresse_glpi}/ <https://{adresse_glpi}/>``_
fr_fr: Pour débuter l’installation, faire pointer le navigateur web sur le dossier racine de GLPI : `https://{adresse_glpi}/ <https://{adresse_glpi}/>`_

source: When GLPI is not installed; a step-by-step installation process begins.
de_de: Wenn GLPI nicht installiert ist, beginnt ein Schritt-für-Schritt-Installationsprozess.
fr_fr: Lorsque GLPI n'est pas installé ; un processus d'installation étape par étape commence.

source: Choose lang (Select your language)
de_de: Wählen Sie Ihre Sprache
fr_fr: Choix de la langue (Select your language)

source: The first step will let you choose the installation language. Select your lang, and click validate.
de_de: Im ersten Schritt können Sie die Installationssprache auswählen. Wählen Sie Ihre Sprache aus und klicken Sie auf Bestätigen.
fr_fr: La première étape permet de choisir la langue dans laquelle se déroulera l’installation. Sélectionner la langue souhaitée, puis valider.

source: License
de_de: Lizenz
fr_fr: Licence

source: Usage of GLPI is subject to GNU license approval. Once licensing terms read and accepted, just validate the form.
de_de: Die Nutzung von GLPI unterliegt der GNU-Lizenz. Sobald die Lizenzbedingungen gelesen und akzeptiert wurden, bestätigen Sie einfach das Formular.
fr_fr: L’utilisation de GLPI est soumise à l’acceptation de la licence d’utilisation GNU. Une fois la licence lue et acceptée, valider le formulaire.

source: If you do not agree with licensing terms, it is not possible to continue installation process.
de_de: Wenn Sie mit den Lizenzbedingungen nicht einverstanden sind, ist es nicht möglich, den Installationsprozess fortzusetzen.
fr_fr: Sans acceptation des termes de la licence, il est impossible d’accéder aux étapes suivantes.

source: Install / Update
de_de: Installation / Update
fr_fr: Installation / mise à jour

source: This screen allows to choose between a fresh GLPI installation or an update.
de_de: Auf diesem Bildschirm kann zwischen einer Neuinstallation von GLPI oder einem Update gewählt werden.
fr_fr: Cet écran permet de choisir entre installer GLPI ou effectuer une mise à jour.

source: Click on install.
de_de: Klicken Sie auf Installieren.
fr_fr: Cliquer sur Installation.

source: Environment checks
de_de: Pürfen der Umgebung
fr_fr: Vérification de l’environnement

source: This step will check if prerequisites are met. If they're not, it is not possible to continue and an explicit error message will tell you about what is wrong and what to do before trying again.
fr_fr: Cette étape va vérifier que le système satisfait les pré-requis. Si ce n’est pas le cas, il est impossible de continuer et un message d’erreur explicite indique les actions à réaliser avant d’essayer à nouveau.

source: Some prerequisites are optionals, it will be possible to continue installation event if they're not met.
fr_fr: Certains pré-requis sont optionnels, il sera alors possible de valider le formulaire même s’ils ne sont pas respectés.

source: Database connection
de_de: Datenbankverbindung
fr_fr: Connexion à la base de données

source: Database connection parameters are asked.
de_de: Datenbank-Verbindungsparameter werden abgefragt.
fr_fr: Les paramètres de connexion à la base de données sont demandés.

source: *MySQL server*: enter the path to your MySQL server, `localhost` or `mysql.domaine.tld` as example;
de_de: *MySQL server*: geben Sie den Pfad zum MySQL-Server an, zum Beispiel `localhost` oder `mysql.domaine.tld`;
fr_fr: *Serveur MySQL* : saisir le chemin de MySQL, par exemple `localhost`, ou `mysql.domaine.tld` ;

source: *MySQL user*: enter user name that is allowed to connect to the Database;
de_de: *MySQL user*: Nutzername der Zugriff auf die Datenbank hat;
fr_fr: *Utilisateur MySQL* : saisir le nom d’utilisateur ayant le droit de se connecter au serveur MySQL ;

source: *MySQL password*: enter user's password.
de_de: *MySQL password*: Nutzerpasswort.
fr_fr: *Mot de passe MySQL* : saisir le mot de passe associé à l’utilisateur.

source: Once all fields are properly filled, validate the form.
de_de: Sobald alle Felder korrekt ausgefüllt sind, bestätigen Sie das Formular.
fr_fr: Une fois que ces champs sont correctement remplis, valider le formulaire.

source: A first database connection is then established. If parameters are invalid, an error message will be displayed, and you'll have to fix parameters and try again.
de_de: Anschließend wird eine erste Datenbankverbindung hergestellt. Wenn die Parameter ungültig sind, wird eine Fehlermeldung angezeigt, und Sie müssen die Parameter korrigieren und es erneut versuchen.
fr_fr: Une première connexion à la base est alors établie. Si les paramètres sont invalides, un message d’erreur est affiché, il faut modifier les paramètres de connexion et essayer à nouveau.

source: Database choice
de_de: Datenbank-Auswahl
fr_fr: Choix de la base de données

source: Once connection to the database server is OK, you have to create or choose the database you want for your GLPI and init it.
de_de: Sobald die Verbindung zum Datenbankserver in Ordnung ist, müssen Sie die gewünschte Datenbank für Ihr GLPI erstellen oder auswählen.
fr_fr: Une fois la connexion au serveur de base de données établie, il faut créer ou choisir la base de données souhaitée pour GLPI et l’initialiser.

source: There are 2 ways to go:
de_de: Es gibt 2 Wege:
fr_fr: Deux possibilités sont offertes :

source: use an existing database
de_de: eine bestehende Datenbank verwenden
fr_fr: Utiliser une base existante

source: Select this database in the displayed list. Validate to use.
de_de: Wählen Sie die Datenbank aus der Liste aus und bestätigen Sie die Verwendung.
fr_fr: Sélectionner cette base de données dans la liste des bases affichées. Valider pour initialiser la base de données.

source: Selected database contents will be destroyed on installation.
de_de: Ausgewählte Datenbankinhalte werden bei der Installation zerstört.
fr_fr: Le contenu de la base de données sélectionnée sera détruit lors de l’initialisation de celle-ci.

source: Create a new database
de_de: Eine neue Datenbank erstellen
fr_fr: Créer une nouvelle base de données

source: Choose *Create a new database*, enter the database name in the relevant field and then validate to create the base.
de_de: Wählen Sie *Eine neue Datenbank erstellen*, geben Sie den Datenbanknamen in das entsprechende Feld ein und bestätigen Sie dann, um die Datenbank zu erstellen.
fr_fr: Sélectionner *Créer une nouvelle base de données*, saisir le nom de la nouvelle base dans le champ prévu à cet effet puis valider pour créer la base de données.

source: SQL user must be able to create new database for this option to work.
de_de: Der SQL-Benutzer muss in der Lage sein, eine neue Datenbank zu erstellen, damit diese Option funktioniert.
fr_fr: L'utilisateur SQL doit être en mesure de créer de nouvelles bases de données pour que cette option fonctionne.

source: Database initialization
de_de: Datenbankinitialisierung
fr_fr: Initialisation de la base de données

source: This step initializes the database with default values.
de_de: In diesem Schritt wird die Datenbank mit Standardwerten initialisiert.
fr_fr: Cette étape initialise la base de données avec les valeurs par défaut.

source: If there is any error; pay attention to the displayed informations.
de_de: Im Falle eines Fehlers beachten Sie die angezeigten Informationen.
fr_fr: En cas d’erreur, lire attentivement les informations affichées.

source: Telemetry informations
de_de: Telemetry-Informationen
fr_fr: Informations de télémétrie

source: GLPI will ask you to share some Telemetry informations and to register. This is not mandatory.
de_de: GLPI wird Sie bitten, einige Telemetrieinformationen mitzuteilen und sich zu registrieren. Dies ist optional.
fr_fr: GLPI proposera le partage de quelques informations de télémétrie ainsi qu'un enregistrement. Ce n'est pas requis.

source: End of installation
de_de: Ende der Installation
fr_fr: Installation terminée

source: This step presents a summary of the installation and give created users list. Please pay attention to those informations and validate to go to the app.
de_de: Dieser Schritt stellt eine Zusammenfassung der Installation dar und gibt die Liste der erstellten Benutzer an. Bitte beachten Sie diese Informationen und bestätigen Sie, um zur App zu gelangen.
fr_fr: Cette étape présente le récapitulatif de la procédure d’installation et donne la liste des comptes utilisateurs créés. Lire attentivement ces informations et valider pour effectuer la première connexion à l’application.

source: Default user accounts are:
de_de: Standard-Benutzerkonten sind:
fr_fr: Les comptes utilisateurs par défaut sont les suivants :

source: *glpi/glpi* admin account,
de_de: *glpi/glpi* Administrator,
fr_fr: *glpi/glpi* pour le compte administrateur,

source: *tech/tech* technical account,
de_de: *tech/tech* Techniker,
fr_fr: *tech/tech* pour le compte technicien,

source: *normal/normal* "normal" account,
de_de: *normal/normal* "Normaler" Nutzer,
fr_fr: *normal/normal* pour le compte "normal",

source: *post-only/postonly* post-only account.
de_de: *post-only/postonly* Nur Senden.
fr_fr: *post-only/postonly* pour le compte post-only.

source: For obvious security concerns, you'll have to delete or edit those accounts.
de_de: Aus Sicherheitsgründen müssen Sie diese Konten löschen oder bearbeiten.
fr_fr: Pour des raisons de sécurité évidentes, supprimer ou modifier ces comptes.

source: Before removing the ``glpi`` account, please make sure you have created another user with ``super-admin`` profile.
de_de: Bevor Sie das ``glpi``` Konto entfernen, vergewissern Sie sich bitte, dass Sie einen anderen Benutzer mit dem Profil ``super-admin``` angelegt haben.
fr_fr: Avant de supprimer le compte ``glpi``, assurez-vous d'avoir créé un autre utilisateur avec le profil ``super-admin``.
