Repository: glpi-project/doc-install
Catalog: source/locale/*/LC_MESSAGES/prerequisites.po
Languages: fr_fr, ru_ru

source: Prerequisites
fr_fr: Pré-requis
ru_ru: Требования

source: GLPI is a Web application that will need:
fr_fr: GLPI est une application web qui nécessite :
ru_ru: GLPI - веб приложение, которое требует:

source: a webserver;
fr_fr: un serveur web ;
ru_ru: веб сервер;

source: a database.
fr_fr: une base de données.
ru_ru: БД;

source: Web server
fr_fr: Serveur web
ru_ru: Веб сервер

source: GLPI requires a web server that supports PHP, like:
fr_fr: GLPI requiert un serveur web qui supporte PHP, tel que :
ru_ru: GLPI требует веб сервер, который поддерживает PHP:

source: `Apache 2 (or more recent) <http://httpd.apache.org>`_;
fr_fr: `Apache 2 (ou plus récent) <http://httpd.apache.org>`_;
ru_ru: `Apache 2 (или более поздней версии) <http://httpd.apache.org>`_;

source: As of 9.5 release, GLPI requires `PHP <http://php.net>`_ 7.2 or more recent.
ru_ru: Начиная с версии 9.5, GLPI требуется `PHP <http://php.net>`_ 7.2 или выше.

source: We recommend to use the most recent stable PHP release for better performances.
ru_ru: Мы рекомендуем использовать самую последнюю стабильную версию PHP для лучшей производительности.

source: Mandatory extensions
fr_fr: Extensions obligatoires
ru_ru: Обязательные расширения

source: Following PHP extensions are required for the app to work properly:
fr_fr: Les extensions PHP suivantes sont requises pour que l'application fonctionne correctement :
ru_ru: Следующие расширения PHP требуются для правильной работы GLPI:

source: ``curl``: for CAS authentication, GLPI version check, Telemetry, ...;
fr_fr: ``curl`` : pour l'authentification CAS, la vérification de la version de GLPI, la télémétrie, ... ;
ru_ru: ``curl``: для CAS аутентификации, проверки версии GLPI , Telemetry, ...;

source: ``fileinfo``: to get extra informations on files;
fr_fr: ``fileinfo`` : pour obtenir des informations sur des fichiers ;
ru_ru: ``fileinfo``: для получения дополнительной информации из файлов;

source: ``gd``: to generate images;
fr_fr: ``gd`` : pour générer des images ;
ru_ru: ``gd``: для генерации изображений;

source: ``json``: to get support for JSON data format;
fr_fr: ``json`` : pour avoir le support du format de données JSON ;
ru_ru: ``json``: для поддержки данных в формате JSON;

source: ``mbstring``: to manage multi bytes characters;
fr_fr: ``mbstring`` : gestion des caractères multi-octet ;
ru_ru: ``mbstring``: для поддержки мультибитовых кодировок;

source: ``mysqli``: to connect and query the database;
fr_fr: ``mysqli`` : pour se connecter et interroger la base de données ;
ru_ru: ``mysqli``: для поддержки и запросов к БД;

source: ``session``: to get user sessions support;
fr_fr: ``session`` : pour le support des sessions utilisateur ;
ru_ru: ``session``: для поддержки сессий пользователей;

source: ``zlib``: to get backup and restore database functions;
fr_fr: ``zlib``: pour activer les fonctionnalités de sauvegarde et de restauration ;
ru_ru: ``zlib``: для поддержи резервного копирования и восстановления БД;

source: Optional extensions
fr_fr: Extensions optionnelles
ru_ru: Дополнительные расширения

source: Even if those extensions are not mandatory, we advise you to install them anyways.
fr_fr: Bien que ces extensions ne soient pas requises, nous conseillons de les installer tout de même.
ru_ru: Даже если эти плагины необязательны, мы, в любом случае, рекомендуем их установить.

source: Following PHP extensions are required for some extra features of GLPI:
fr_fr: Les extensions PHP suivantes sont requises pour des fonctionnalités annexes de GLPI :
ru_ru: Следующие PHP расширения требуются для некоторых дополнительных функций GLPI:

source: ``cli``: to use PHP from command line (scripts, automatic actions, and so on);
fr_fr: ``cli`` : pour utiliser PHP en ligne de commande (script, actions automatiques, entre autres) ;
ru_ru: ``cli``: для использования PHP из коммандной строки (скрипты, автоматические действия и тд);

source: ``domxml``: used for CAS authentication;
fr_fr: ``domxml`` : pour l'authentification utilisateur CAS ;
ru_ru: ``domxml``: используется для CAS аутентификации;

source: ``imap``: used for mail collector ou user authentication;
fr_fr: ``imap`` : utilisé pour la collection des courriels ou l'authentification de l'utilisateur ;
ru_ru: ``imap``: используется для аутентификации сборщика почты;

source: ``ldap``: use LDAP directory for authentication;
fr_fr: ``ldap`` : utiliser un répertoire LDAP pour l'authentification ;
ru_ru: ``ldap``: используется для аутентификации через LDAP сервер;

source: ``openssl``: secured communications;
fr_fr: ``openssl``: communications sécurisées;
ru_ru: ``openssl``: защищенные соединения;

source: ``xmlrpc``: used for XMLRPC API.
fr_fr: ``xmlrpc``: utilisé par l'API XMLRPC.
ru_ru: ``xmlrpc``: используется для XMLRPC API.

source: ``APCu``: may be used for cache; among others (see `caching configuration (in french only) <http://glpi-user-documentation.readthedocs.io/fr/latest/advanced/cache.html>`_.
fr_fr: ``APCu``: peut être utilisé - parmi d'autres - comme système de cache ; voir `la configuration du cache <http://glpi-user-documentation.readthedocs.io/fr/latest/advanced/cache.html>`_.
ru_ru: ``APCu``: может использоваться для кеширования; среди прочих (смотри `конфигурацию кеширования (только на французском) <http://glpi-user-documentation.readthedocs.io/fr/latest/advanced/cache.html>`_.

source: Configuration
ru_ru: Конфигурация

source: PHP configuration file (``php.ini``) must be adapted to reflect following variables:
fr_fr: Le fichier de configuration de PHP (``php.ini``) doit être adapté pour réfléter les variables suivantes :
ru_ru: В конфигурационным файле PHP (``php.ini``) должен быть настроены следующие переменные:

source: memory_limit = 64M ; // max memory limit
ru_ru: memory_limit = 64M ; // максимальный предел памяти

source: max_execution_time = 600 ; // not mandatory but recommended
ru_ru: max_execution_time = 600 ; // не обязательно, но рекомендуется

source: session.use_trans_sid = 0 ; // not mandatory but recommended
ru_ru: session.use_trans_sid = 0 ; // не обязательно, но рекомендуется

source: Database
fr_fr: Base de données
ru_ru: База данных

source: Currently, only `MySQL <https://dev.mysql.com>`_ (5.6 minimum) and `MariaDB <https://mariadb.com>`_ (10.0 minimum) database servers are supported by GLPI.
ru_ru: На данный момент, GLPI поддерживает сервера БД только `MySQL <https://dev.mysql.com>`_ (5.6 и выше) и `MariaDB <https://mariadb.com>`_ (10.0 и выше).

source: In order to work, GLPI requires a database server.
fr_fr: Pour fonctionner, GLPI nécessite un serveur de base de données.
ru_ru: Для работы GLPI требуется сервер БД.

source: As of 9.2 release, GLPI requires `PHP <http://php.net>`_ 5.6 or more recent.
fr_fr: Depuis la version 9.2, GLPI requiert `PHP <http://php.net>`_ 5.6 ou plus récent.

source: We recommand to use the most recent stable PHP release for better performances.
fr_fr: Nous vous recommandons d'utiliser la dernière version stable de PHP poru de meilleures performances.

source: Currently, only `MySQL <https://dev.mysql.com>`_ (5.1 minimum) and `MariaDB <https://mariadb.com>`_ database servers are supported by GLPI.
fr_fr: Actuellement, seuls les serveurs de base de données `MySQL <https://dev.mysql.com>`_ (5.1 minimum) et `MariaDB <https://mariadb.com>`_ sont supportés par GLPI.

source: We recommand to use at least 5.5 version if you use MySQL for better performances.
fr_fr: Nous recommandons d’utiliser la version 5.5.x pour de meilleurs meilleures performances si vous utilisez MySQL.
